uhnp/src/DataProcessors/ВзысканиеДебиторскойЗадолженности/ВзысканиеДебиторскойЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВзысканиеДебиторскойЗадолженности</name>
</mdclass:DataProcessor>

uhnp/src/Documents/ИзменениеПретензии/ИзменениеПретензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПретензии</name>
  <basedOn>Catalog.ПретензииУХ</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>InformationRegister.ХодПретензионноИсковойРаботы</registerRecords>
  <registerRecords>InformationRegister.ВерсииГрафиковРасчетов</registerRecords>
  <attributes>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.ПретензииУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПозицияОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПозицияКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Суд</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Судья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОжидаемогоВозвратаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВ_БДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаШтрафа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПретензия</name>
    <type>
      <types>CatalogRef.Претензии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПредметаСпора</name>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.РасчетныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ОтражениеФактическихДанныхБюджетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>DefinedType.ОбъектРасчетовУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Пени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейПросрочки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <comment>Сумма с учетом вероятности</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/ПретензииУХ/ПретензииУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПретензииУХ</name>
  <basedOn>Catalog.Лоты</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтражениеФактическихДанныхБюджетирования</basedOn>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <basedOn>Document.КвалификацияПоставщика</basedOn>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <attributes>
    <name>ТипПретензии</name>
    <type>
      <types>EnumRef.ТипыПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСпора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВ_БДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияПретензий</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/DataProcessors/ВзысканиеДебиторскойЗадолженности/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметровДинамическогоСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СтруктураПараметровДинамическогоСписка.Вставить("ТекстЗапроса", ПретензионноИсковаяРабота.ТекстЗапросаПросроченнаяЗадолженность(Ложь));
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ПросроченнаяЗадолженность, СтруктураПараметровДинамическогоСписка);
	ПросроченнаяЗадолженность.Параметры.УстановитьЗначениеПараметра("ДатаДляГенерации", КонецДня(ТекущаяДатаСеанса()));     
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ИзменениеПретензии" Тогда
		Элементы.ПросроченнаяЗадолженность.Обновить();
		Элементы.НеЗакрытыеПретензии.Обновить();
	КонецЕсли;	
	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Элементы.ПросроченнаяЗадолженность.Обновить();
	Элементы.НеЗакрытыеПретензии.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьПретензию(Команда)

	ТекущиеДанные = Элементы.НеЗакрытыеПретензии.ТекущиеДанные;
	Если ТекущиеДанные =  Неопределено тогда
		Возврат;
	КонецЕсли;  
	
	ОткрытьФорму("Обработка.ВзысканиеДебиторскойЗадолженности.Форма.ФормаЗакрытия", 
					Новый Структура("Претензия", ТекущиеДанные.Претензия), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПретензию(Команда)

	ТД = Элементы.ПросроченнаяЗадолженность.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ТД.Организация);
	ДанныеЗаполнения.Вставить("Контрагент", ТД.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", ТД.Договор);

	РасшифровкаПредметаСпора = Новый Структура;	
	РасшифровкаПредметаСпора.Вставить("ОбъектРасчетов", ТД.ОбъектРасчетов);
	РасшифровкаПредметаСпора.Вставить("РасчетныйДокумент", ТД.РасчетныйДокумент);
	РасшифровкаПредметаСпора.Вставить("Сумма", ТД.Сумма);    
	РасшифровкаПредметаСпора.Вставить("ДнейПросрочки", ТД.ДнейПросрочки); 
	РасшифровкаПредметаСпора.Вставить("Пени", ТД.Пени);
	
	ДанныеЗаполнения.Вставить("РасшифровкаПредметаСпора", РасшифровкаПредметаСпора);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Основание", ДанныеЗаполнения);
	
	ОткрытьФорму("Документ.ИзменениеПретензии.ФормаОбъекта", ДопПараметры, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭтап(Команда)
	
	Если Элементы.НеЗакрытыеПретензии.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОткрытьФорму("Справочник.ПретензииУХ.ФормаОбъекта", 
			Новый Структура("Ключ", Элементы.НеЗакрытыеПретензии.ТекущиеДанные.Претензия));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПросроченнаяЗадолженность

&НаКлиенте
Процедура ПросроченнаяЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ПросроченнаяЗадолженность.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если Поле = Элементы.ПросроченнаяЗадолженностьРасчетныйДокумент Тогда
		ЗначениеДляПоказа = ТД.РасчетныйДокумент;
	ИначеЕсли Поле = Элементы.ПросроченнаяЗадолженностьОбъектРасчетов Тогда
		ЗначениеДляПоказа = ТД.ОбъектРасчетов;
	ИначеЕсли Поле = Элементы.ПросроченнаяЗадолженностьДоговор Тогда
		ЗначениеДляПоказа = ТД.Договор;
	ИначеЕсли Поле = Элементы.ПросроченнаяЗадолженностьКонтрагент Тогда
		ЗначениеДляПоказа = ТД.Контрагент;
	ИначеЕсли Поле = Элементы.ПросроченнаяЗадолженностьОрганизация Тогда
		ЗначениеДляПоказа = ТД.Организация;
	Иначе
		ЗначениеДляПоказа = неопределено;
	КонецЕсли;
	
	Если ЗначениеДляПоказа <> неопределено Тогда
		ПоказатьЗначение(, ЗначениеДляПоказа);
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНеЗакрытыеПретензии    

&НаКлиенте
Процедура НеЗакрытыеПретензииПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	НеЗакрытыеПретензииОткрытьФормуПретензии();  
КонецПроцедуры

&НаКлиенте
Процедура НеЗакрытыеПретензииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НеЗакрытыеПретензииОткрытьФормуПретензии();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НеЗакрытыеПретензииОткрытьФормуПретензии()

	Если Элементы.НеЗакрытыеПретензии.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПретензииУХ.ФормаОбъекта", 
				Новый Структура("Ключ", Элементы.НеЗакрытыеПретензии.ТекущиеДанные.Претензия));

КонецПроцедуры

#КонецОбласти
